CSI API ETABS v1
cDStSP16_13330_2011 Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDStSP16_13330_2011
Public Interface cDStSP16_13330_2011
Dim instance As cDStSP16_13330_2011
public interface class cDStSP16_13330_2011
type cDStSP16_13330_2011 =  interface end
The cDStSP16_13330_2011 type exposes the following members.
Methods
Name | Description
GetOverwrite
 Retrieves the value of a steel design overwrite item
GetPreference
 Retrieves the value of a steel design preference item
SetOverwrite
 Sets the value of a steel design overwrite item
SetPreference
 Sets the value of a steel design preference item
Top
See Also
Reference
ETABSv1 Namespace